In [33]:
#keep index
import pandas as pd
import numpy as np
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [35]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [36]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [37]:
np.sin(df*np.pi/4)

              A         B         C         D
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

In [38]:
#align at Series index
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population')
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [39]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [40]:
A.add(B, fill_value=1)

0    3.0
1    5.0
2    9.0
3    6.0
dtype: float64

In [42]:
A = pd.DataFrame(rng.randint(0, 20, (2,2)), columns=list('AB'))
A

    A  B
0  18  6
1   8  6

In [43]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  1  3  8
1  1  9  8
2  9  4  1

In [44]:
A + B

      A    B   C
0  21.0  7.0 NaN
1  17.0  7.0 NaN
2   NaN  NaN NaN

In [45]:
A.add(B, fill_value=A.stack().mean())

      A     B     C
0  21.0   7.0  17.5
1  17.0   7.0  17.5
2  13.5  18.5  10.5

In [48]:
A = rng.randint(10, size=(3,4))
A

array([[7, 6, 8, 7],
       [4, 1, 4, 7],
       [9, 8, 8, 0]])

In [49]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-3, -5, -4,  0],
       [ 2,  2,  0, -7]])

In [51]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[1]

   Q  R  S  T
0  3  5  4  0
1  0  0  0  0
2  5  7  4 -7

In [52]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  1  0  2  1
1  3  0  3  6
2  1  0  0 -8

In [53]:
halfrow = df.iloc[0,::2]
halfrow

Q    7
S    8
Name: 0, dtype: int64